///Завдання 3: Логічні оператори
/// 1) Створіть змінні hasMoney і isStoreOpen (типу bool).
/// 2) Перевірте:
///   Чи можна зробити покупку (якщо є гроші і магазин відкритий).
///   Чи потрібно почекати (якщо магазин закритий або немає грошей).
/// 3) Використайте оператори &&, ||, !.
///
/// Повертає Record, що містить булеві результати перевірок:
/// - `canBuy`: `true`, якщо можна зробити покупку (якщо є гроші І магазин відкритий).
/// - `shouldWait`: `true`, якщо потрібно почекати (якщо магазин закритий АБО немає грошей).
(bool canBuy, bool shouldWait) task3(bool hasMoney, bool isStoreOpen) =>
    (hasMoney && isStoreOpen, !hasMoney || !isStoreOpen);