/// Завдання 1: Математичні оператори
/// 1) Створіть змінні довжина і ширина прямокутника (ширина 18.4, висота 30.9)
/// 2) Обчисліть площу і периметр прямокутника.
/// 3) Виведіть площу і периметр.
/// 4) Використайте оператор ~/ для обчислення скільки повних квадратів 1х1 вміщається у площу.
///
/// Приймає [width] (ширину) і [height] (висоту) прямокутника.
///
/// Повертає Record, що містить:
/// - `area` (площа)
/// - `perimeter` (периметр)
/// - `fullSquares1x1` (кількість повних квадратів 1x1, що вміщаються в площу)
(double area, double perimeter, int fullSquares1x1) task1(double width, double height) =>
    (width * height, 2 * (width + height), width * height ~/ 1);
