final List<String> ukrainianNames1 = [
  'Андрій', 'Богдан', 'Василь', 'Ганна', 'Григорій',
  'Дмитро', 'Євген', 'Зоряна', 'Іван', 'Ірина',
  'Катерина', 'Кирило', 'Леся', 'Лідія', 'Людмила',
  'Максим', 'Марія', 'Марта', 'Михайло', 'Назар',
  'Наталія', 'Оксана', 'Олег', 'Олена', 'Олександр',
  'Олексій', 'Павло', 'Петро', 'Роман', 'Руслана',
  'Світлана', 'Сергій', 'Софія', 'Степан', 'Тарас',
  'Тетяна', 'Уляна', 'Федір', 'Христина', 'Юлія',
  'Юрій', 'Ярослав', 'Володимир', 'Валентина', 'Віталій',
  'Зінаїда', 'Марко', 'Лілія', 'Данило', 'Ілля'
];

final List<String> ukrainianNames2 = [
  'Олександр', 'Марія', 'Іван', 'Тетяна', 'Дмитро',
  'Наталія', 'Андрій', 'Олена', 'Сергій', 'Ірина',
  'Василь', 'Ольга', 'Микола', 'Людмила', 'Володимир',
  'Галина', 'Юрій', 'Вікторія', 'Петро', 'Світлана',
  'Павло', 'Валентина', 'Богдан', 'Зоряна', 'Роман',
  'Катерина', 'Тарас', 'Оксана', 'Віталій', 'Леся',
  'Михайло', 'Анна', 'Костянтин', 'Софія', 'Олег',
  'Христина', 'Федір', 'Яна', 'Артем', 'Поліна',
  'Євген', 'Уляна', 'Назар', 'Ярослава', 'Максим',
  'Марина', 'Денис', 'Аліна', 'Гліб', "Дар'я"
];